# Pandas

In [2]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [7]:
df1 = pd.DataFrame([[1,5,2,8],[8,5,4,7],[7,9,2,1],[5,7,2,6],[7,0,4,3]])

In [8]:
df1

   0  1  2  3
0  1  5  2  8
1  8  5  4  7
2  7  9  2  1
3  5  7  2  6
4  7  0  4  3

In [9]:
df1.head(3)

   0  1  2  3
0  1  5  2  8
1  8  5  4  7
2  7  9  2  1

In [10]:
df1.tail(4)

   0  1  2  3
1  8  5  4  7
2  7  9  2  1
3  5  7  2  6
4  7  0  4  3

# Slicing , Adding columns and other dataframes

In [11]:
df1

   0  1  2  3
0  1  5  2  8
1  8  5  4  7
2  7  9  2  1
3  5  7  2  6
4  7  0  4  3

In [12]:
df1.shape

(5, 4)

In [13]:
df1.iloc[0,1]   #accesing element

5

In [14]:
df1.iloc[0:2,0:2]

   0  1
0  1  5
1  8  5

In [15]:
df1.iloc[0:2,1:3]

   1  2
0  5  2
1  5  4

In [16]:
df1 = pd.DataFrame([[1,5,2,8],[8,5,4,7],[7,9,2,1],[5,7,2,6],[7,0,4,3]],columns=['A','B','C','D'])
df1

   A  B  C  D
0  1  5  2  8
1  8  5  4  7
2  7  9  2  1
3  5  7  2  6
4  7  0  4  3